## Introduction

This is a notebook I use to learn more about Pandas. As such, I try to follow a basic path, as creating a data frame, describing the data and other steps. Some of the examples come from my work on data, and some wrangling I had to do to analyze and create models.

In [1]:
# Step 0. Load libraries
import pandas as pd
import numpy as np

### 1.1 Creating a dataframe

Pandas has many methods fo creating a new dataframe object. One easy method is to create an empty dataframe and then define each column separately.

In [2]:
# Create an empty data frame object
df = pd.DataFrame()

In [3]:
# Then create each column, and add elements using lists
df['id'] = [1,2,3,4,5,6]
df['call_id'] = [200,200,200,300,300,300]
df['result'] = ['answering machine','call back','call back',\
               'still workable','transfer call','do not call']
df['code_result'] = ['am','cb','cb','sw','tc','dc']

In [4]:
# Let's print the dataframe
df

   id  call_id             result code_result
0   1      200  answering machine          am
1   2      200          call back          cb
2   3      200          call back          cb
3   4      300     still workable          sw
4   5      300      transfer call          tc
5   6      300        do not call          dc

### 1.2 Describing the data

We want to view some characteristics of a dataframe, like the mean, standard deviation and count of elements

In [5]:
# Let's load a dataset, from UCI
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/00267/data_banknote_authentication.txt'
# This dataset comes without header
df = pd.read_csv(url, sep = ',', header = None, \
                 names=['varWav','skeWav','curtWav','entropy','class'])

This dataset comes from UCI Data Banknote Authentication dataset, and the data was extracted from images that were taken for the evaluation of an authentication procedure for banknotes. Wavelet Transform tool were used to extract features from images [1]. The features (and type) are:

1. variance of Wavelet Transformed image (continuous) 
2. skewness of Wavelet Transformed image (continuous) 
3. curtosis of Wavelet Transformed image (continuous) 
4. entropy of image (continuous) 
5. class (integer)

In [6]:
# Let's look how is the dataset, the head, tail and dimensions
df

       varWav    skeWav  curtWav  entropy  class
0     3.62160   8.66610  -2.8073 -0.44699      0
1     4.54590   8.16740  -2.4586 -1.46210      0
2     3.86600  -2.63830   1.9242  0.10645      0
3     3.45660   9.52280  -4.0112 -3.59440      0
4     0.32924  -4.45520   4.5718 -0.98880      0
...       ...       ...      ...      ...    ...
1367  0.40614   1.34920  -1.4501 -0.55949      1
1368 -1.38870  -4.87730   6.4774  0.34179      1
1369 -3.75030 -13.45860  17.5932 -2.77710      1
1370 -3.56370  -8.38270  12.3930 -1.28230      1
1371 -2.54190  -0.65804   2.6842  1.19520      1

[1372 rows x 5 columns]

In [7]:
# Now let's see the statistics
df.describe()

            varWav       skeWav      curtWav      entropy        class
count  1372.000000  1372.000000  1372.000000  1372.000000  1372.000000
mean      0.433735     1.922353     1.397627    -1.191657     0.444606
std       2.842763     5.869047     4.310030     2.101013     0.497103
min      -7.042100   -13.773100    -5.286100    -8.548200     0.000000
25%      -1.773000    -1.708200    -1.574975    -2.413450     0.000000
50%       0.496180     2.319650     0.616630    -0.586650     0.000000
75%       2.821475     6.814625     3.179250     0.394810     1.000000
max       6.824800    12.951600    17.927400     2.449500     1.000000

We need to be cautious because pandas treats the column 'class' as numeric, because it contains 1s and 0s, but in this case the numerical values represent categories.

### 3.3 Navigating dataframes

Sometimes we need to select individual data or slices of a dataframe.

In [8]:
# Let's select the first row
df.iloc[0]

varWav     3.62160
skeWav     8.66610
curtWav   -2.80730
entropy   -0.44699
class      0.00000
Name: 0, dtype: float64

In [9]:
# Now let's select three rows
df.iloc[0:3]

   varWav  skeWav  curtWav  entropy  class
0  3.6216  8.6661  -2.8073 -0.44699      0
1  4.5459  8.1674  -2.4586 -1.46210      0
2  3.8660 -2.6383   1.9242  0.10645      0

In [10]:
# We can index our dataset, for example by class
df = df.set_index(df['class'])

### 1.4 Selecting rows based on conditionals

In [50]:
# Let's read the Titanic Dataset
url = 'https://raw.githubusercontent.com/chrisalbon/kaggle/master/titanic/data/train.csv'
df_tc = pd.read_csv(url)
df_tc

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
# Let's filter by sex "female", and show only the first two rows
df_tc[df_tc['Sex']=='female'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

We have created a condition, that the column 'Sex' must be equal to 'female'. After that, we call the method head and specify we want only two columns.

In [13]:
# Now let's filter by sex 'female' and passengers over 60
df_tc[(df_tc['Sex']=='female') & (df_tc['Age']>=60)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

Note that for two or more conditions, we need to enclose them in parenthesis.

### 1.5 Replacing values

It's is common to replace values, like renaming some classes, or converting to lower case. To do so in Pandas, you can use the method replace.

In [14]:
# Let's replace a pair of values
df_tc['Sex'].replace(['female','male'],['Woman','Man']).head(5)

0      Man
1    Woman
2    Woman
3    Woman
4      Man
Name: Sex, dtype: object

We have applied the replacement on the dataset, but it hasn't changed, just its copy. We can also find and replace across the entire dataset and not only in a single column:

In [15]:
# We can perform a replacement for all the values 1 into 'One'
df_tc.replace(1,"One").head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,One,0,3,"Braund, Mr. Owen Harris",male,22.0,One,0,A/5 21171,7.2500,NaN,S
1,2,One,One,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,One,0,PC 17599,71.2833,C85,C
2,3,One,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [16]:
# Now we can use regular expressions
df_tc.replace(r'Mr','Mister', regex=True).tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mister. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mister. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### 1.6 Renaming columns

Now we can rename columns using the methed 'rename' in pandas.

In [17]:
df_tc.rename(columns={'Pclass':'Passenger class'}).head(2)

,PassengerId,Survived,Passenger class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

Let's notice that we have used a dictionary to rename the column. We can add many other columns if we want to rename more columns in our dataset.

### 1.7 Finding the minimum, maximum, sum, average and count

Sometimes we want only the values of interest, not all the dataframe or summaries. For that, we can use the methods max, min, mean, sum and count, and paste into strings or pass as variables.

In [18]:
# Let's paste some common descriptive statistics
f"For Age variable, max is: {df_tc['Age'].max():.0f}, min is: {df_tc['Age'].min():.0f}, \
mean is: {df_tc['Age'].mean():.2f}, sum of ages is {df_tc['Age'].sum():.0f} and count is {df_tc['Age'].count()}"

'For Age variable, max is: 80, min is: 0, mean is: 29.70, sum of ages is 21205 and count is 714'

In [19]:
# We can even count for all the variables
df_tc.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

### 1.8 Finding unique values

Now we can get all the unique values of a column, so we can use the method "unique" on our target column.

In [20]:
# Let's see the unique values of cabin
df_tc['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [21]:
# But what if only want to see the count of unique values of 'Cabin'
df_tc['Cabin'].nunique()

147

In [22]:
# We can see the counts for each unique value of sex
df_tc['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

### 1.9 Handling missing values

Missing values is a common staple on datasets. You must be aware of missing values, python treats them as NaN and some techniques are necessary to deal with them. The methods isnull and notnull are useful for this

In [23]:
# Let's see all rows with age missing
df_tc[df_tc['Age'].isnull()].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

NaN means not a number, that is defined in numpy. For example, if we want to replace all males with NaN, we must use numpy to invoke NaN.

In [24]:
df_tc['Sex'].replace('male',np.nan)

0         NaN
1      female
2      female
3      female
4         NaN
        ...
886       NaN
887    female
888    female
889       NaN
890       NaN
Name: Sex, Length: 891, dtype: object

### 1.10 Deleting a column

Sometimes we just want to delete a column that is not useful for our analysis. The best way is to use the method drop with the parameter axis = 1 (that means the column axis. 0 is the row axis).

In [25]:
# Let's drop the Age variable
df_tc.drop('Age', axis = 1).head(2)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C

In [26]:
# Now let's drop variables Age and Cabin
df_tc.drop(['Age','Cabin'], axis = 1).head(2)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C

In [27]:
# You can drop columns by number of colum, in this case variable survived
df_tc.drop(df_tc.columns[1], axis = 1).head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

One advice is that we should treat dataframes as inmutable objects, because if we use let's say inplace=True we are treating our dataframe as a mutable object. So let's create a copy of any change we make on our dataset to avoid problems in our data processing pipelines.

### 1.11 Deleting a row

Sometimes we want to delete observations or 'rows' from our dataset, so we can apply the drop method too.

In [28]:
# Delete the first two rows
df_tc.drop([0,1], axis = 0).head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S

In [29]:
# Let's apply some conditions to delete observations
df_tc[df_tc['Name']!='Heikkinen, Miss. Laina'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [30]:
# We can use the index, that by default is the row number
df_tc[df_tc.index != 0].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## 1.12 Dropping Duplicate Rows

We want to drop duplicate rows from the Titanic dataset. To find duplicated for all columns we can use this code:

In [31]:
df_tc.drop_duplicates().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Now what if we want to drop based only on some columns?

In [32]:
df_tc.drop_duplicates(subset=['Name'], keep='first').head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 1.13 Grouping Rows by Values

Now we want to group individual rows according to some shared value. We'll use groupby

In [34]:
# This will group by sex and the will take all the columns where it is possible to apply a mean (numerics)
df_tc.groupby('Sex').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [41]:
# Now what if we only want some columns? 
df_tc.groupby('Sex')[['Age','Fare']].mean()

              Age       Fare
Sex
female  27.915709  44.479818
male    30.726645  25.523893

In [42]:
# Now what if we want to group by survival, then class, and see the average fare?
df_tc.groupby(['Sex','Pclass'])[['Fare']].mean()
#. It seems that females paid more on average

                     Fare
Sex    Pclass
female 1       106.125798
       2        21.970121
       3        16.118810
male   1        67.226127
       2        19.741782
       3        12.661633

In [47]:
# What was the survival rate by sex?
df_tc.groupby(['Sex'])[['Survived']].mean()
# Females got more chances to survive than males

        Survived
Sex
female  0.742038
male    0.188908

In [68]:
# How many passengers survived?
df_tc.groupby(['Survived'])[['Name']].count()

          Name
Survived
0          549
1          342

In [69]:
# What was the average age by sex for survivors
df_tc.groupby(['Sex','Survived'])[['Age']].mean()

                       Age
Sex    Survived
female 0         25.046875
       1         28.847716
male   0         31.618056
       1         27.276022

## 1.14 Grouping Rows by Time
Sometimes we need to group by specific periods (month, year, weeks, etc.)

In [79]:
# Let's create a time series
time_index = pd.date_range('01/01/2021', periods=120, freq='1D')
# Then a dataframe
df_time = pd.DataFrame(index = time_index)
# The let's add random numbers
df_time['Sales_Amount'] = np.random.randint(10, 30, 120)

In [81]:
# Now let's group by month
df_time.resample('M').sum()
# We have to remember that resample requires the index to be datetime

            Sales_Amount
2021-01-31           627
2021-02-28           541
2021-03-31           592
2021-04-30           564

In [83]:
# We see that the groupings index are the last date of the month. What if we want the previous date?
df_time.resample('M', label='left').sum()

            Sales_Amount
2020-12-31           627
2021-01-31           541
2021-02-28           592
2021-03-31           564

## 1.15 Looping Over a Column
Let's iterate over every element in a column to apply a function

In [84]:
# Print first two names, uppercased
for name in df_tc['Name'][0:2]:
    print(name.upper())

BRAUND, MR. OWEN HARRIS
CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)

In [87]:
# Use a list comprehension
[name.upper() for name in df_tc['Name'][0:2]]
# This returns a list. Notice this is not a pythonic way!

['BRAUND, MR. OWEN HARRIS',
 'CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)']

## 1.16 Applying a function over all elements
Let's apply a function over elements in a column

In [92]:
def uppername(name):
    return name.upper()

df_tc['Name'].apply(uppername)[0:2]

0                              BRAUND, MR. OWEN HARRIS
1    CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
Name: Name, dtype: object

## 1.17 Applying functions to groups
Now we want to apply a function to custom groups

In [93]:
df_tc.groupby('Sex').apply(lambda x: x.count())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,,
female,314,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,577,453,577,577,577,577,107,577

### 2. References

[1] UCI Machine Learning Repository. (May 22, 2021). Banknote Authentication Dataset. Retrieved from https://archive.ics.uci.edu/ml/datasets/banknote+authentication

## 1.18 Concatenating DataFrames
What if we want to join dataframes by row or by column. We can use concat

In [95]:
data_a = pd.DataFrame({"id": [1,2,3,4,5], "name" : ['Joe','Jack','Jim','Jill','Jeb']})
data_b = pd.DataFrame({"id": [6,7], "name": ['Jeff','Jun']})

In [97]:
# Check that dataframes must be inside a list
pd.concat([data_a, data_b], axis=0)

   id  name
0   1   Joe
1   2  Jack
2   3   Jim
3   4  Jill
4   5   Jeb
0   6  Jeff
1   7   Jun

In [98]:
# Note that by column you don't mix the cols
pd.concat([data_a, data_b], axis=1)

   id  name   id  name
0   1   Joe  6.0  Jeff
1   2  Jack  7.0   Jun
2   3   Jim  NaN   NaN
3   4  Jill  NaN   NaN
4   5   Jeb  NaN   NaN

In [99]:
# You can append series too
my_row = pd.Series([8, 'Jude'], index=['id','name'])
data_a.append(my_row, ignore_index=True)

   id  name
0   1   Joe
1   2  Jack
2   3   Jim
3   4  Jill
4   5   Jeb
5   8  Jude

## 1.19 Merging DataFrames
Merging works as SQL joins (left, right, inner, full)

In [107]:
data_c = pd.DataFrame({'id':[1,2,3,4,9], 'sales':[1000,3000,1400,2000,1100]})
# The basic join is left join, which anchors the left dataframe and joins the right df. If no value is there, returns NaN 
pd.merge(data_a, data_c, how='left', on='id')

   id  name   sales
0   1   Joe  1000.0
1   2  Jack  3000.0
2   3   Jim  1400.0
3   4  Jill  2000.0
4   5   Jeb     NaN

In [103]:
# This merge only grabs the common elements in both dataframes
pd.merge(data_a, data_c, how='inner', on='id')

   id  name  sales
0   1   Joe   1000
1   2  Jack   3000
2   3   Jim   1400
3   4  Jill   2000

In [105]:
# This works like a full join in SQL
pd.merge(data_a, data_c, how='outer', on='id')

   id  name   sales
0   1   Joe  1000.0
1   2  Jack  3000.0
2   3   Jim  1400.0
3   4  Jill  2000.0
4   5   Jeb     NaN
5   9   NaN  1100.0

In [106]:
# What if the common columns have different names? We use left_on, right_on
pd.merge(data_a, data_c, how='left', left_on='id', right_on='id')

   id  name   sales
0   1   Joe  1000.0
1   2  Jack  3000.0
2   3   Jim  1400.0
3   4  Jill  2000.0
4   5   Jeb     NaN